fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.ФизическоеЛицо</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>DefinedType.ВКМ_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличествоДнейОтпуска</name>
      <type>
        <types>DefinedType.ВКМ_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГрафикОтпусков.Обновление = Ложь;
	
	ДанныеГрафика = ПолучитьИзВременногоХранилища(Параметры.АдресДанныеГрафика);
	
	Если ЗначениеЗаполнено(ДанныеГрафика) Тогда
		ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
		ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГода(ДанныеГрафика[0].ДатаНачала), КонецГода(ДанныеГрафика[0].ДатаОкончания));
	КонецЕсли;
	
	ГрафикОтпусков.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
	ГрафикОтпусков.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Фиксированная;
	ГрафикОтпусков.КратностьПериодическогоВарианта = 4;
	
	Для Каждого Строка Из ДанныеГрафика Цикл
	
		ТочкаСотрудник = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);
		ТочкаСотрудник.Текст = Строка(Строка.Сотрудник);
		
		СерияОтпуск = ГрафикОтпусков.УстановитьСерию("Отпуск");
		СерияОтпуск.Текст = "Отпуск";
		
		Отпуск = ГрафикОтпусков.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		
		ИнтервалОтпуск = Отпуск.Добавить();
		ИнтервалОтпуск.Начало = Строка.ДатаНачала;
		ИнтервалОтпуск.Конец = Строка.ДатаОкончания;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
